[
    {
        "name": "Acid Splash",
        "level": 0,
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "school": "Conjuration",
        "data": {
            "casting_time": "1 action",
            "range": "60 feet",
            "components": "V, S",
            "duration": "Instantaneous",
            "description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 acid damage.\n\nThis spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
        }
    },
    {
        "name": "Mage Hand",
        "level": 0,
        "classes": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "school": "Conjuration",
        "data": {
            "casting_time": "1 action",
            "range": "30 feet",
            "components": "V, S",
            "duration": "1 minute",
            "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\n\nThe hand can't attack, activate magic items, or carry more than 10 pounds."
        }
    },
    {
        "name": "Fireball",
        "level": 3,
        "classes": [
            "Sorcerer",
            "Wizard"
        ],
        "school": "Evocation",
        "data": {
            "casting_time": "1 action",
            "range": "150 feet",
            "components": "V, S, M (a tiny ball of bat guano and sulfur)",
            "duration": "Instantaneous",
            "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.\n\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.",
            "higher_levels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd."
        }
    }
]